Revit 2027 API
RebarCoupler.GetCoupledReinforcementData Method
 gets the reinforcement data. The returned list will have size = 2. If coupler stays on only one bar one element in this list will be null.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ReinforcementData> GetCoupledReinforcementData()
Public Function GetCoupledReinforcementData As IList(Of ReinforcementData)
public:
IList<ReinforcementData^>^ GetCoupledReinforcementData()
member GetCoupledReinforcementData : unit -> IList<ReinforcementData>
Return Value
IList<ReinforcementData>
See Also
Reference
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace